Repository: duiliotacconi/DT.AL
Catalog: BC27-Performance-Features/Translations/BC27 Performance Features Demo.*_tradnl.xlf
Languages: es_es_tradnl

# Page 1901643891 - Control 2618029887 - Property 1295455071
source: Specifies the type of GUID generation used (Standard or Sequential).
es_es_tradnl: Especifica el tipo de generación GUID utilizada (Estándar o Secuencial).

# Page 1901643891 - Action 1036244905 - Property 1295455071
source: Runs the GUID performance test to compare standard GUIDs vs sequential GUIDs.
es_es_tradnl: Ejecuta la prueba de rendimiento GUID para comparar GUIDs estándar frente a GUIDs secuenciales.

# Page 1901643891 - Action 1036244905 - Property 2879900210
source: Run Performance Test
es_es_tradnl: Ejecutar prueba de rendimiento

# Page 1401071321 - Property 2879900210
source: Enter Number of Records
es_es_tradnl: Introduzca número de registros

# Page 1401071321 - NamedType 3914061860
source: Number of records must be greater than 0.
es_es_tradnl: El número de registros debe ser mayor que 0.

# Page 1401071321 - Control 3123527090 - Property 1968111052
source: The demo will create this many records with standard GUIDs and sequential GUIDs to compare performance.
es_es_tradnl: La demostración creará esta cantidad de registros con GUID estándar y GUID secuenciales para comparar el rendimiento.

# Page 1401071321 - Control 3123527090 - Property 2879900210
source: Information
es_es_tradnl: [NAB: SUGGESTION]Información

# Page 1401071321 - Control 3567459362 - Property 2879900210
source: Performance Test Parameters
es_es_tradnl: Parámetros de prueba de rendimiento

# Page 1401071321 - Control 1736541834 - Property 1295455071
source: Enter the number of records to insert for the performance test.
es_es_tradnl: Introduzca el número de registros que se insertarán para la prueba de rendimiento.

# Page 1401071321 - Control 1736541834 - Property 2879900210
source: Number of Records
es_es_tradnl: Número de registros

# Page 3160445442 - Property 2879900210
source: Enter Lock Timeout Duration
es_es_tradnl: Introduzca duración del tiempo de espera de bloqueo

# Page 3160445442 - NamedType 1908182519
source: Timeout must be greater than 0 seconds.
es_es_tradnl: El tiempo de espera debe ser mayor que 0 segundos.

# Page 3160445442 - Control 3123527090 - Property 1968111052
source: Background holds lock for 15 seconds. Values < 15 will timeout, values > 15 should succeed.
es_es_tradnl: El segundo plano mantiene el bloqueo durante 15 segundos. Los valores < 15 agotarán el tiempo de espera, los valores > 15 deberían tener éxito.

# Page 3160445442 - Control 3123527090 - Property 2879900210
source: Information
es_es_tradnl: [NAB: SUGGESTION]Información

# Page 3160445442 - Control 3567459362 - Property 2879900210
source: Lock Timeout Duration
es_es_tradnl: Duración del tiempo de espera de bloqueo

# Page 3160445442 - Control 766984748 - Property 1295455071
source: Enter the lock timeout duration in seconds.
es_es_tradnl: Introduzca la duración del tiempo de espera de bloqueo en segundos.

# Page 3160445442 - Control 766984748 - Property 2879900210
source: Timeout (seconds)
es_es_tradnl: Tiempo de espera (segundos)

# Page 955075197 - Property 2879900210
source: Details
es_es_tradnl: [NAB: SUGGESTION]Detalles

# Page 955075197 - Control 2798619357 - Property 1295455071
source: Displays the SQL Server statement captured by the performance profiler
es_es_tradnl: Muestra la instrucción de SQL Server capturada por el generador de perfiles de rendimiento

# Page 955075197 - Control 2798619357 - Property 2879900210
source: SQL Statement
es_es_tradnl: Instrucción SQL

# Page 4048465728 - Property 2879900210
source: Profiling Nodes
es_es_tradnl: Nodos de generación de perfiles

# Page 4048465728 - Control 971044367 - Property 1295455071
source: Function or method name captured by the profiler
es_es_tradnl: Nombre de la función o método capturado por el generador de perfiles

# Page 4048465728 - Control 3286003210 - Property 1295455071
source: Number of times this node was executed
es_es_tradnl: Número de veces que se ejecutó este nodo

# Page 4048465728 - Control 653747200 - Property 1295455071
source: Indicates whether this is a SQL statement
es_es_tradnl: Indica si se trata de una instrucción SQL

# Page 4048465728 - Control 66992343 - Property 1295455071
source: Line number in the source code
es_es_tradnl: Número de línea en el código fuente

# Page 4048465728 - Control 1618236431 - Property 1295455071
source: Unique identifier for the profiling node
es_es_tradnl: Identificador único para el nodo de generación de perfiles

# Page 4048465728 - Control 3711240756 - Property 1295455071
source: ID of AL object
es_es_tradnl: Id. de objeto AL

# Page 4048465728 - Control 1418569422 - Property 1295455071
source: Name of AL object
es_es_tradnl: Nombre de objeto AL

# Page 4048465728 - Control 1085746399 - Property 1295455071
source: Type of AL object
es_es_tradnl: Tipo de objeto AL

# Page 948821877 - Property 2879900210
source: Truncate Performance Monitor
es_es_tradnl: [NAB: SUGGESTION]Monitor de rendimiento de Truncate

# Page 948821877 - Control 883711285 - Property 1295455071
source: Specifies the entry number of the log record.
es_es_tradnl: Especifica el número de movimiento del registro de registro.

# Page 948821877 - Control 3127005848 - Property 1295455071
source: Specifies the date and time when the operation was executed.
es_es_tradnl: Especifica la fecha y hora en que se ejecutó la operación.

# Page 948821877 - Control 3156524383 - Property 1295455071
source: Specifies the type of operation (DeleteAll or Truncate).
es_es_tradnl: Especifica el tipo de operación (DeleteAll o Truncate).

# Page 948821877 - Control 2699180384 - Property 1295455071
source: Specifies the number of records affected by the operation.
es_es_tradnl: Especifica el número de registros afectados por la operación.

# Page 948821877 - Control 3808951907 - Property 1295455071
source: Specifies the name of the table where the operation was performed.
es_es_tradnl: Especifica el nombre de la tabla donde se realizó la operación.

# Page 948821877 - Control 2708250016 - Property 1295455071
source: Specifies the user who executed the operation.
es_es_tradnl: Especifica el usuario que ejecutó la operación.

# Page 948821877 - Action 3183963928 - Property 1295455071
source: Runs the Truncate demonstration to compare performance between DeleteAll and Truncate methods.
es_es_tradnl: Ejecuta la demostración de Truncate para comparar el rendimiento entre los métodos DeleteAll y Truncate.

# Page 948821877 - Action 3183963928 - Property 2879900210
source: Run Truncate Demo
es_es_tradnl: Ejecutar demostración de Truncate

# Page 384403156 - Property 2879900210
source: Truncate Performance Test Setup
es_es_tradnl: Configuración de prueba de rendimiento de Truncate

# Page 384403156 - NamedType 614856224
source: Both Filter From and Filter To must be greater than 0 when filtering is enabled.
es_es_tradnl: Tanto Filter From como Filter To deben ser mayores que 0 cuando el filtrado está habilitado.

# Page 384403156 - NamedType 3459022188
source: Filter From must be greater than 0.
es_es_tradnl: Filter From debe ser mayor que 0.

# Page 384403156 - NamedType 3282096652
source: Filter From must be less than or equal to Filter To.
es_es_tradnl: Filter From debe ser menor o igual que Filter To.

# Page 384403156 - NamedType 109647125
source: Filter To cannot exceed the total number of records (%1).
es_es_tradnl: Filter To no puede exceder el número total de registros (%1).

# Page 384403156 - NamedType 2378980511
source: Filter To must be greater than 0.
es_es_tradnl: Filter To debe ser mayor que 0.

# Page 384403156 - NamedType 3914061860
source: Number of records must be greater than 0.
es_es_tradnl: El número de registros debe ser mayor que 0.

# Page 384403156 - Control 3123527090 - Property 1968111052
source: Without filtering: compares DeleteAll() vs Truncate() on full table. With filtering: compares DeleteAll() vs Truncate() on filtered records.
es_es_tradnl: Sin filtrado: compara DeleteAll() vs Truncate() en tabla completa. Con filtrado: compara DeleteAll() vs Truncate() en registros filtrados.

# Page 384403156 - Control 3123527090 - Property 2879900210
source: Information
es_es_tradnl: [NAB: SUGGESTION]Información

# Page 384403156 - Control 3567459362 - Property 2879900210
source: Performance Test Parameters
es_es_tradnl: Parámetros de prueba de rendimiento

# Page 384403156 - Control 921621410 - Property 1295455071
source: Starting entry number for the filter range. Only used when filtering is enabled.
es_es_tradnl: Número de movimiento inicial para el rango de filtro. Solo se usa cuando el filtrado está habilitado.

# Page 384403156 - Control 921621410 - Property 2879900210
source: Filter From Entry No.
es_es_tradnl: N.º mov. Filter From

# Page 384403156 - Control 950108477 - Property 1295455071
source: Ending entry number for the filter range. Only used when filtering is enabled.
es_es_tradnl: Número de movimiento final para el rango de filtro. Solo se usa cuando el filtrado está habilitado.

# Page 384403156 - Control 950108477 - Property 2879900210
source: Filter To Entry No.
es_es_tradnl: N.º mov. Filter To

# Page 384403156 - Control 1736541834 - Property 1295455071
source: Enter the number of records to create for the performance test.
es_es_tradnl: Introduzca el número de registros que se crearán para la prueba de rendimiento.

# Page 384403156 - Control 1736541834 - Property 2879900210
source: Number of Records
es_es_tradnl: Número de registros

# Page 384403156 - Control 1389180058 - Property 1295455071
source: Enable to test both Truncate and DeleteAll with filters to compare performance.
es_es_tradnl: Habilite para probar tanto Truncate como DeleteAll con filtros para comparar el rendimiento.

# Page 384403156 - Control 1389180058 - Property 2879900210
source: Test with Filtering
es_es_tradnl: Probar con filtrado

# Enum 198663249 - Property 2879900210
source: Document Type
es_es_tradnl: Tipo documento

# Enum 198663249 - EnumValue 2004364593 - Property 2879900210
source: Credit Memo
es_es_tradnl: Abono

# Enum 198663249 - EnumValue 821689635 - Property 2879900210
source: Invoice
es_es_tradnl: Factura

# Enum 1352703510 - Property 2879900210
source: GUID Record Type
es_es_tradnl: Tipo de registro GUID

# Enum 1352703510 - EnumValue 3103406403 - Property 2879900210
source: Sequential
es_es_tradnl: Secuencial

# Enum 1352703510 - EnumValue 2672704373 - Property 2879900210
source: Standard
es_es_tradnl: Estándar

# Enum 2246001357 - Property 2879900210
source: Operation Type
es_es_tradnl: [NAB: SUGGESTION]Tipo de operación

# Enum 311623126 - Property 2879900210
source: Status
es_es_tradnl: Estado

# Enum 311623126 - EnumValue 1090351696 - Property 2879900210
source: Active
es_es_tradnl: Activo

# Enum 311623126 - EnumValue 525852245 - Property 2879900210
source: Inactive
es_es_tradnl: Inactivo

# Enum 311623126 - EnumValue 3208180638 - Property 2879900210
source: Processed
es_es_tradnl: Procesado

# PermissionSet 1634778039 - Property 2879900210
source: BC27 Performance Features
es_es_tradnl: Características de rendimiento de BC27
