Repository: duiliotacconi/DT.AL
Catalog: BC27-Performance-Features/Translations/BC27 Performance Features Demo.*.xlf
Languages: ar_sa, de_de

# Table 2716516865 - Property 2879900210
source: Customer Demo
ar_sa: عرض توضيحي للعميل
de_de: Kunden-Demo

# Table 2716516865 - Field 4190130733 - Property 2879900210
source: Customer No.
ar_sa: رقم العميل
de_de: [NAB: SUGGESTION]Debitorennr. [NAB: SUGGESTION]Debitorennummer

# Table 2716516865 - Field 1524911010 - Property 2879900210
source: Last Sales Date
ar_sa: تاريخ آخر مبيعات
de_de: Letztes Verkaufsdatum

# Table 2716516865 - Field 2961552353 - Property 2879900210
source: Name
ar_sa: الاسم
de_de: [NAB: SUGGESTION]Name

# Table 2716516865 - Field 2662608856 - Property 2879900210
source: No. of Sales Entries
ar_sa: عدد قيود المبيعات
de_de: Anzahl Verkaufsposten

# Table 1988126737 - Property 2879900210
source: GUID Performance Test Table
ar_sa: جدول اختبار أداء GUID
de_de: GUID-Leistungstesttabelle

# Table 1988126737 - Field 788537400 - Property 2879900210
source: Creation Time
ar_sa: وقت الإنشاء
de_de: [NAB: SUGGESTION]Erstellungszeit

# Table 1988126737 - Field 3461834954 - Property 2879900210
source: Description
ar_sa: الوصف
de_de: [NAB: SUGGESTION]Beschreibung [NAB: SUGGESTION]Description

# Table 1988126737 - Field 3483320773 - Property 2879900210
source: Performance Notes
ar_sa: ملاحظات الأداء
de_de: Leistungshinweise

# Table 1988126737 - Field 2897660500 - Property 2879900210
source: Record ID
ar_sa: معرف السجل
de_de: [NAB: SUGGESTION]Datensatz-ID

# Table 1988126737 - Field 2618029887 - Property 2879900210
source: Record Type
ar_sa: نوع السجل
de_de: Datensatztyp

# Table 1268937166 - Field 3461834954 - Property 2879900210
source: Description
ar_sa: الوصف
de_de: [NAB: SUGGESTION]Beschreibung [NAB: SUGGESTION]Description

# Table 1268937166 - Field 883711285 - Property 2879900210
source: Entry No.
ar_sa: رقم القيد
de_de: [NAB: SUGGESTION]Lfd. Nr. [NAB: SUGGESTION]Postennr. [NAB: SUGGESTION]Zeilennr. [NAB: SUGGESTION]Postennummer

# Table 1268937166 - Field 3320823955 - Property 2879900210
source: Line No.
ar_sa: رقم السطر
de_de: [NAB: SUGGESTION]Zeilennr. [NAB: SUGGESTION]Lfd. Nr.

# Table 1268937166 - Field 158172202 - Property 2879900210
source: Line Type
ar_sa: نوع السطر
de_de: [NAB: SUGGESTION]Zeilenart

# Table 2002860834 - Property 2879900210
source: Profiling Node
ar_sa: عقدة التصنيف
de_de: Profilierungsknoten

# Table 2002860834 - Field 883711285 - Property 2879900210
source: Entry No.
ar_sa: رقم القيد
de_de: [NAB: SUGGESTION]Lfd. Nr. [NAB: SUGGESTION]Postennr. [NAB: SUGGESTION]Zeilennr. [NAB: SUGGESTION]Postennummer

# Table 2002860834 - Field 971044367 - Property 2879900210
source: Function Name
ar_sa: اسم الوظيفة
de_de: [NAB: SUGGESTION]Funktionsname

# Table 2002860834 - Field 3286003210 - Property 2879900210
source: Hit Count
ar_sa: عدد الإصابات
de_de: [NAB: SUGGESTION]Trefferanzahl

# Table 2002860834 - Field 653747200 - Property 2879900210
source: Is SQL
ar_sa: هل هو SQL
de_de: Ist SQL

# Table 2002860834 - Field 66992343 - Property 2879900210
source: Line Number
ar_sa: رقم السطر
de_de: Zeilennummer

# Table 2002860834 - Field 1618236431 - Property 2879900210
source: Node ID
ar_sa: معرف العقدة
de_de: [NAB: SUGGESTION]Knoten-ID

# Table 2002860834 - Field 3711240756 - Property 2879900210
source: Object ID
ar_sa: معرف الكائن
de_de: [NAB: SUGGESTION]Objekt-ID

# Table 2002860834 - Field 1418569422 - Property 2879900210
source: Object Name
ar_sa: اسم الكائن
de_de: [NAB: SUGGESTION]Objektname

# Table 2002860834 - Field 1085746399 - Property 2879900210
source: Object Type
ar_sa: نوع الكائن
de_de: [NAB: SUGGESTION]Objektart [NAB: SUGGESTION]Objekttyp

# Table 2002860834 - Field 2798619357 - Property 2879900210
source: SQL Statement
ar_sa: عبارة SQL
de_de: SQL-Anweisung

# Table 1294644360 - Property 2879900210
source: Sales Entry
ar_sa: قيد المبيعات
de_de: Verkaufsposten

# Table 1294644360 - Field 636392376 - Property 2879900210
source: Amount
ar_sa: المبلغ
de_de: [NAB: SUGGESTION]Betrag

# Table 1294644360 - Field 4190130733 - Property 2879900210
source: Customer No.
ar_sa: رقم العميل
de_de: [NAB: SUGGESTION]Debitorennr. [NAB: SUGGESTION]Debitorennummer

# Table 1294644360 - Field 2363328873 - Property 2879900210
source: Document Type
ar_sa: نوع المستند
de_de: [NAB: SUGGESTION]Belegart [NAB: SUGGESTION]Belegtyp

# Table 1294644360 - Field 883711285 - Property 2879900210
source: Entry No.
ar_sa: رقم القيد
de_de: [NAB: SUGGESTION]Lfd. Nr. [NAB: SUGGESTION]Postennr. [NAB: SUGGESTION]Zeilennr. [NAB: SUGGESTION]Postennummer

# Table 1294644360 - Field 3710982960 - Property 2879900210
source: Posting Date
ar_sa: تاريخ الترحيل
de_de: [NAB: SUGGESTION]Buchungsdatum

# Table 514555293 - Property 2879900210
source: Truncate Demo Table
ar_sa: جدول عرض Truncate
de_de: Tabelle für Truncate-Demo

# Table 514555293 - Field 636392376 - Property 2879900210
source: Amount
ar_sa: المبلغ
de_de: [NAB: SUGGESTION]Betrag

# Table 514555293 - Field 2500892784 - Property 2879900210
source: Created Date
ar_sa: تاريخ الإنشاء
de_de: [NAB: SUGGESTION]Erstellungsdatum

# Table 514555293 - Field 3461834954 - Property 2879900210
source: Description
ar_sa: الوصف
de_de: [NAB: SUGGESTION]Beschreibung [NAB: SUGGESTION]Description

# Table 514555293 - Field 883711285 - Property 2879900210
source: Entry No.
ar_sa: رقم القيد
de_de: [NAB: SUGGESTION]Lfd. Nr. [NAB: SUGGESTION]Postennr. [NAB: SUGGESTION]Zeilennr. [NAB: SUGGESTION]Postennummer

# Table 514555293 - Field 984476005 - Property 2879900210
source: Last Modified
ar_sa: آخر تعديل
de_de: [NAB: SUGGESTION]Letzte Änderung

# Table 514555293 - Field 513339096 - Property 2879900210
source: Status
ar_sa: الحالة
de_de: [NAB: SUGGESTION]Status

# Table 2626921960 - Property 2879900210
source: Truncate Log Table
ar_sa: جدول سجل Truncate
de_de: Truncate-Protokolltabelle

# Table 2626921960 - Field 883711285 - Property 2879900210
source: Entry No.
ar_sa: رقم القيد
de_de: [NAB: SUGGESTION]Lfd. Nr. [NAB: SUGGESTION]Postennr. [NAB: SUGGESTION]Zeilennr. [NAB: SUGGESTION]Postennummer

# Table 2626921960 - Field 3127005848 - Property 2879900210
source: Operation DateTime
ar_sa: تاريخ ووقت العملية
de_de: Vorgangsdatum/-zeit

# Table 2626921960 - Field 3156524383 - Property 2879900210
source: Operation Type
ar_sa: نوع العملية
de_de: Vorgangstyp

# Table 2626921960 - Field 2699180384 - Property 2879900210
source: Records Affected
ar_sa: السجلات المتأثرة
de_de: Betroffene Datensätze

# Table 2626921960 - Field 3808951907 - Property 2879900210
source: Table Name
ar_sa: اسم الجدول
de_de: [NAB: SUGGESTION]Tabellenname

# Table 2626921960 - Field 2708250016 - Property 2879900210
source: User ID
ar_sa: معرف المستخدم
de_de: [NAB: SUGGESTION]Benutzer-ID

# Codeunit 2566973998 - NamedType 3924526594
source: %1 profiling nodes extracted and displayed.
ar_sa: تم استخراج وعرض %1 عقدة تصنيف.
de_de: %1 Profilierungsknoten extrahiert und angezeigt.

# Codeunit 2334946661 - NamedType 3576202793
source: Do you want to continue?
ar_sa: هل تريد المتابعة؟
de_de: Möchten Sie fortfahren?

# Codeunit 2334946661 - NamedType 3563305185
source: This demo will:
ar_sa: سيقوم هذا العرض بـ:
de_de: Diese Demo wird:

# Codeunit 2334946661 - NamedType 1999354891
source: Examples:
ar_sa: أمثلة:
de_de: Beispiele:

# Codeunit 2334946661 - NamedType 215669783
source: Failed to start background session.
ar_sa: فشل بدء الجلسة في الخلفية.
de_de: Fehler beim Starten der Hintergrundsitzung.

# Codeunit 2334946661 - NamedType 2184892397
source: Item %1 not found.
ar_sa: لم يتم العثور على الصنف %1.
de_de: Artikel %1 nicht gefunden.

# Codeunit 2334946661 - NamedType 3734205098
source: Lock timeout must be greater than 0 seconds.
ar_sa: يجب أن يكون مهلة القفل أكبر من 0 ثانية.
de_de: Sperrzeitlimit muss größer als 0 Sekunden sein.

# Codeunit 2334946661 - NamedType 1966629216
source: No items found. Please create at least one item to run this demo.
ar_sa: لم يتم العثور على أصناف. يرجى إنشاء صنف واحد على الأقل لتشغيل هذا العرض.
de_de: Keine Artikel gefunden. Bitte erstellen Sie mindestens einen Artikel, um diese Demo auszuführen.

# Codeunit 2334946661 - NamedType 1904284849
source: Operation succeeded!\\ \\Original timeout duration: %1 seconds\\New timeout duration: %2 seconds\\Elapsed time: %3 seconds
ar_sa: نجحت العملية!\\ \\مدة المهلة الأصلية: %1 ثانية\\مدة المهلة الجديدة: %2 ثانية\\الوقت المنقضي: %3 ثانية
de_de: Vorgang erfolgreich!\\ \\Ursprüngliche Timeout-Dauer: %1 Sekunden\\Neue Timeout-Dauer: %2 Sekunden\\Verstrichene Zeit: %3 Sekunden

# Codeunit 2334946661 - NamedType 3868920883
source: 1. Start a background session that locks an Item record for 15 seconds
ar_sa: 1. بدء جلسة خلفية تقفل سجل صنف لمدة 15 ثانية
de_de: 1. Eine Hintergrundsitzung starten, die einen Artikeldatensatz für 15 Sekunden sperrt

# Codeunit 2334946661 - NamedType 4032900822
source: 2. Allow you to set Database.LockTimeoutDuration (BC 27 feature)
ar_sa: 2. السماح لك بتعيين Database.LockTimeoutDuration (ميزة BC 27)
de_de: 2. Ermöglicht das Festlegen von Database.LockTimeoutDuration (BC 27-Funktion)

# Codeunit 2334946661 - NamedType 2006519413
source: 3. Try to access the locked record
ar_sa: 3. محاولة الوصول إلى السجل المقفل
de_de: 3. Versuchen, auf den gesperrten Datensatz zuzugreifen

# Codeunit 2334946661 - NamedType 1784210992
source: - Timeout > 15 sec → Should succeed (lock released after 15 sec)
ar_sa: - المهلة > 15 ثانية → يجب أن تنجح (يتم تحرير القفل بعد 15 ثانية)
de_de: - Timeout > 15 Sek. → Sollte erfolgreich sein (Sperre wird nach 15 Sek. freigegeben)

# Codeunit 2334946661 - NamedType 2107666801
source: - Timeout < 15 sec → Lock timeout error
ar_sa: - المهلة < 15 ثانية → خطأ مهلة القفل
de_de: - Timeout < 15 Sek. → Sperrzeitüberschreitungsfehler

# Codeunit 3398506205 - NamedType 3810741809
source: Sales Order posted successfully!
ar_sa: تم ترحيل أمر المبيعات بنجاح!
de_de: Verkaufsauftrag erfolgreich gebucht!

# Codeunit 3398506205 - Method 2084031962 - NamedType 4172508015
source: Line No.
ar_sa: رقم السطر
de_de: Zeilennr.

# Codeunit 3398506205 - Method 2084031962 - NamedType 961827798
source: Type
ar_sa: النوع
de_de: Art

# Codeunit 3398506205 - Method 2084031962 - NamedType 1314000525
source: No.
ar_sa: الرقم
de_de: Nr.

# Codeunit 3398506205 - Method 2084031962 - NamedType 1668520216
source: Lines created for %1 %2:
ar_sa: السطور المنشأة لـ %1 %2:
de_de: Zeilen erstellt für %1 %2:

# Codeunit 1800383584 - NamedType 3569966352
source: Description
ar_sa: الوصف
de_de: Beschreibung

# Codeunit 1800383584 - NamedType 4172508015
source: Line No.
ar_sa: رقم السطر
de_de: Zeilennr.

# Codeunit 1800383584 - NamedType 3035987594
source: Line processed %1:
ar_sa: السطر المعالج %1:
de_de: [NAB: REVIEW]Zeile verarbeitet %1: %2: %3, %4: %5, %6: %7

# Codeunit 1800383584 - NamedType 817293845
source: LogMessage is empty but RecordCount = %1
ar_sa: LogMessage فارغ ولكن RecordCount = %1
de_de: LogMessage ist leer, aber RecordCount = %1

# Codeunit 1800383584 - NamedType 461794111
source: No lines were captured in the temp table.
ar_sa: لم يتم التقاط أي سطور في الجدول المؤقت.
de_de: Es wurden keine Zeilen in der temporären Tabelle erfasst.

# Codeunit 1800383584 - NamedType 1979967096
source: Total lines processed: %1\\ \\Legacy Posting Feature: %2\\ \\%3
ar_sa: إجمالي السطور المعالجة: %1\\ \\ميزة الترحيل القديمة: %2\\ \\%3
de_de: Verarbeitete Zeilen insgesamt: %1\\ \\Legacy-Buchungsfunktion: %2\\ \\%3

# Codeunit 1800383584 - NamedType 961827798
source: Type
ar_sa: النوع
de_de: Art

# Codeunit 968069251 - NamedType 118881108
source: Performance comparison with FILTERING:\\ \\Total records created: %1\\Filtered records (%2 to %3): %4\\ \\DeleteAll with filter: %5 ms\\Truncate with filter: %6 ms\\ \\Improvement: %7%\\ \\Note: Truncate works with filters and is faster!
ar_sa: مقارنة الأداء مع التصفية:\\ \\إجمالي السجلات المنشأة: %1\\السجلات المصفاة (%2 إلى %3): %4\\ \\DeleteAll مع التصفية: %5 مللي ثانية\\Truncate مع التصفية: %6 مللي ثانية\\ \\التحسين: %7%\\ \\ملاحظة: Truncate يعمل مع التصفية وهو أسرع!
de_de: Leistungsvergleich mit FILTERUNG:\\ \\Erstellte Datensätze insgesamt: %1\\Gefilterte Datensätze (%2 bis %3): %4\\ \\DeleteAll mit Filter: %5 ms\\Truncate mit Filter: %6 ms\\ \\Verbesserung: %7%\\ \\Hinweis: Truncate funktioniert mit Filtern und ist schneller!

# Codeunit 968069251 - NamedType 2585194780
source: Performance comparison with FILTERING:\\ \\Total records created: %1\\Filtered records (%2 to %3): %4\\ \\DeleteAll with filter: %5 ms\\Truncate with filter: %6 ms\\ \\Performance degradation: %7%\\ \\WARNING: In this case, Truncate with filters is SLOWER than DeleteAll!\\Consider using DeleteAll for filtered deletions when deleting a small subset of records.
ar_sa: مقارنة الأداء مع التصفية:\\ \\إجمالي السجلات المنشأة: %1\\السجلات المصفاة (%2 إلى %3): %4\\ \\DeleteAll مع التصفية: %5 مللي ثانية\\Truncate مع التصفية: %6 مللي ثانية\\ \\تدهور الأداء: %7%\\ \\تحذير: في هذه الحالة، Truncate مع التصفية أبطأ من DeleteAll!\\فكر في استخدام DeleteAll للحذف المصفى عند حذف مجموعة فرعية صغيرة من السجلات.
de_de: Leistungsvergleich mit FILTERUNG:\\ \\Erstellte Datensätze insgesamt: %1\\Gefilterte Datensätze (%2 bis %3): %4\\ \\DeleteAll mit Filter: %5 ms\\Truncate mit Filter: %6 ms\\ \\Leistungsminderung: %7%\\ \\WARNUNG: In diesem Fall ist Truncate mit Filtern LANGSAMER als DeleteAll!\\Erwägen Sie die Verwendung von DeleteAll für gefilterte Löschungen beim Löschen einer kleinen Teilmenge von Datensätzen.

# Codeunit 968069251 - NamedType 2842742159
source: Performance comparison for %1 records (FULL TABLE):\\ \\DeleteAll: %2 ms\\Truncate: %3 ms\\ \\Note: Truncate is optimized for full table deletion.
ar_sa: مقارنة الأداء لـ %1 سجل (الجدول بالكامل):\\ \\DeleteAll: %2 مللي ثانية\\Truncate: %3 مللي ثانية\\ \\ملاحظة: Truncate محسّن لحذف الجدول بالكامل.
de_de: Leistungsvergleich für %1 Datensätze (GESAMTE TABELLE):\\ \\DeleteAll: %2 ms\\Truncate: %3 ms\\ \\Hinweis: Truncate ist für das Löschen vollständiger Tabellen optimiert.

# Codeunit 968069251 - NamedType 3914061860
source: Number of records must be greater than 0.
ar_sa: يجب أن يكون عدد السجلات أكبر من 0.
de_de: Anzahl der Datensätze muss größer als 0 sein.

# Codeunit 968069251 - NamedType 3172945005
source: Testing with %1 records (filtering from %2 to %3)...
ar_sa: الاختبار بـ %1 سجل (التصفية من %2 إلى %3)...
de_de: Test mit %1 Datensätzen (Filterung von %2 bis %3)...

# Codeunit 968069251 - NamedType 2406755997
source: Testing with %1 records...
ar_sa: الاختبار بـ %1 سجل...
de_de: Test mit %1 Datensätzen...

# Codeunit 968069251 - NamedType 1165098304
source: Truncate operations completed.\\ \\Truncate is NOT possible when:\\ \\• Table is not a SQL table\\ \\• Table is a system table\\ \\• Used inside try functions\\ \\• Security filters are active\\ \\• There are subscribers to OnBeforeDelete/OnAfterDelete\\ \\• Table has Media fields\\ \\• Too many rows are Marked\\ \\• There are filters on FlowFields\\ \\Always test performance with your specific data patterns.
ar_sa: اكتملت عمليات Truncate.\\ \\Truncate غير ممكن عندما:\\ \\• الجدول ليس جدول SQL\\ \\• الجدول جدول نظام\\ \\• يستخدم داخل دوال try\\ \\• تكون مرشحات الأمان نشطة\\ \\• هناك مشتركون في OnBeforeDelete/OnAfterDelete\\ \\• الجدول يحتوي على حقول وسائط\\ \\• عدد كبير جدًا من الصفوف معلّمة\\ \\• هناك تصفية على FlowFields\\ \\اختبر الأداء دائمًا مع أنماط بياناتك المحددة.
de_de: Truncate-Vorgänge abgeschlossen.\\ \\Truncate ist NICHT möglich wenn:\\ \\• Tabelle ist keine SQL-Tabelle\\ \\• Tabelle ist eine Systemtabelle\\ \\• Innerhalb von Try-Funktionen verwendet\\ \\• Sicherheitsfilter sind aktiv\\ \\• Es gibt Abonnenten für OnBeforeDelete/OnAfterDelete\\ \\• Tabelle hat Medienfelder\\ \\• Zu viele Zeilen sind markiert (Marked)\\ \\• Es gibt Filter auf FlowFields\\ \\Testen Sie immer die Leistung mit Ihren spezifischen Datenmustern.

# Codeunit 2779520303 - NamedType 3789985513
source: Hooray!\\ \\GUID Comparison (4 consecutive records):\\ \\Standard GUIDs (random order):\\%1\\ \\Sequential GUIDs (ordered):\\%2\\ \\Sequential GUIDs are more performant for database indexing!
ar_sa: رائع!\\ \\مقارنة GUID (4 سجلات متتالية):\\ \\معرفات GUID القياسية (ترتيب عشوائي):\\%1\\ \\معرفات GUID التسلسلية (مرتبة):\\%2\\ \\معرفات GUID التسلسلية أكثر أداءً لفهرسة قاعدة البيانات!
de_de: Hurra!\\ \\GUID-Vergleich (4 aufeinanderfolgende Datensätze):\\ \\Standard-GUIDs (zufällige Reihenfolge):\\%1\\ \\Sequenzielle GUIDs (geordnet):\\%2\\ \\Sequenzielle GUIDs sind leistungsfähiger für die Datenbankindizierung!

# Codeunit 2779520303 - NamedType 3865284284
source: Performance comparison with %1 records:\\ \\Standard GUID: %2 ms\\Sequential GUID: %3 ms\\ \\Improvement: %4%
ar_sa: مقارنة الأداء بـ %1 سجل:\\ \\GUID قياسي: %2 مللي ثانية\\GUID تسلسلي: %3 مللي ثانية\\ \\التحسين: %4%
de_de: Leistungsvergleich mit %1 Datensätzen:\\ \\Standard-GUID: %2 ms\\Sequenzielle GUID: %3 ms\\ \\Verbesserung: %4%

# Codeunit 2779520303 - NamedType 3914061860
source: Number of records must be greater than 0.
ar_sa: يجب أن يكون عدد السجلات أكبر من 0.
de_de: Anzahl der Datensätze muss größer als 0 sein.

# Codeunit 2779520303 - NamedType 124992251
source: Sequential GUID Record %1
ar_sa: سجل GUID تسلسلي %1
de_de: Sequenzieller GUID-Datensatz %1

# Codeunit 2779520303 - NamedType 1261132669
source: Standard GUID Record %1
ar_sa: سجل GUID قياسي %1
de_de: Standard-GUID-Datensatz %1

# Codeunit 2779520303 - NamedType 2406755997
source: Testing with %1 records...
ar_sa: الاختبار بـ %1 سجل...
de_de: Test mit %1 Datensätzen...

# Codeunit 3014493327 - NamedType 3720626351
source: Profile download cancelled or failed.
ar_sa: تم إلغاء أو فشل تنزيل الملف الشخصي.
de_de: Profil-Download abgebrochen oder fehlgeschlagen.

# Codeunit 3014493327 - NamedType 647078506
source: Profile downloaded successfully!\\You can open it in Visual Studio Code with the AL Profiler extension\\to view SQL statements, execution times, and row counts.
ar_sa: تم تنزيل الملف الشخصي بنجاح!\\يمكنك فتحه في Visual Studio Code باستخدام إضافة AL Profiler\\لعرض عبارات SQL وأوقات التنفيذ وعدد الصفوف.
de_de: Profil erfolgreich heruntergeladen!\\Sie können es in Visual Studio Code mit der AL Profiler-Erweiterung öffnen,\\um SQL-Anweisungen, Ausführungszeiten und Zeilenanzahlen anzuzeigen.

# Page 1765029509 - Property 2879900210
source: BC27 Performance Features Demo
ar_sa: عرض ميزات الأداء في BC27
de_de: BC27 Leistungsfunktionen Demo

# Page 1765029509 - NamedType 3569966352
source: This app demonstrates the new performance features introduced in Business Central 27.
ar_sa: يوضح هذا التطبيق ميزات الأداء الجديدة في Business Central 27.
de_de: Diese App demonstriert die neuen Leistungsfunktionen, die in Business Central 27 eingeführt wurden.

# Page 1765029509 - NamedType 482611872
source: Optimized FlowField Calculations: Improved performance for FlowField operations
ar_sa: حسابات FlowField المحسّنة: تحسين الأداء لعمليات FlowField
de_de: Optimierte FlowField-Berechnungen: Verbesserte Leistung für FlowField-Operationen

# Page 1765029509 - NamedType 3378221178
source: Posting Order: Improved posting sequence for better performance
ar_sa: ترتيب الترحيل: تحسين تسلسل الترحيل لأداء أفضل
de_de: Buchungsreihenfolge: Verbesserte Buchungssequenz für bessere Leistung

# Page 1765029509 - NamedType 881096440
source: LockTimeout: Better handling of database lock timeouts
ar_sa: LockTimeout: معالجة أفضل لمهلات قفل قاعدة البيانات
de_de: LockTimeout: Bessere Handhabung von Datenbank-Sperrzeitlimits

# Page 1765029509 - NamedType 1382634222
source: Guid.CreateSequentialGuid: More performant GUID generation for database keys
ar_sa: Guid.CreateSequentialGuid: إنشاء GUID أكثر أداءً لمفاتيح قاعدة البيانات
de_de: Guid.CreateSequentialGuid: Leistungsfähigere GUID-Generierung für Datenbankschlüssel

# Page 1765029509 - NamedType 226034597
source: SQL Calls in Performance Profiler: View detailed SQL execution information
ar_sa: استدعاءات SQL في مصنّف الأداء: عرض معلومات تنفيذ SQL التفصيلية
de_de: SQL-Aufrufe im Leistungsprofiler: Detaillierte SQL-Ausführungsinformationen anzeigen

# Page 1765029509 - NamedType 1780485894
source: Rec.Truncate: Faster data cleanup for large tables
ar_sa: Rec.Truncate: تنظيف بيانات أسرع للجداول الكبيرة
de_de: Rec.Truncate: Schnellere Datenbereinigung für große Tabellen

# Page 1765029509 - NamedType 94419588
source: Welcome to the BC 27 Performance Features Demo!
ar_sa: مرحبًا بك في عرض ميزات الأداء في BC 27!
de_de: Willkommen zur BC 27 Leistungsfunktionen Demo!

# Page 1765029509 - Control 3704584207 - Property 2879900210
source: Application Features
ar_sa: ميزات التطبيق
de_de: Anwendungsfunktionen

# Page 1765029509 - Control 1021118283 - Property 2879900210
source: Developer Features
ar_sa: ميزات المطور
de_de: Entwicklerfunktionen

# Page 1765029509 - Control 2445482498 - Property 2879900210
source: BC 27 Performance Features Demonstration
ar_sa: عرض ميزات الأداء في BC 27
de_de: BC 27 Leistungsfunktionen Demonstration

# Page 1765029509 - Control 561197438 - Property 2879900210
source: Server Team Features
ar_sa: ميزات فريق الخادم
de_de: Server-Team-Funktionen

# Page 1765029509 - Action 3930027771 - Property 2879900210
source: Demo Data Lists
ar_sa: قوائم بيانات العرض
de_de: Demo-Datenlisten

# Page 1765029509 - Action 632936411 - Property 1295455071
source: Opens the FlowField performance demonstration page.
ar_sa: يفتح صفحة عرض أداء FlowField.
de_de: Öffnet die FlowField-Leistungsdemoseite.

# Page 1765029509 - Action 632936411 - Property 2879900210
source: FlowField Performance Demo
ar_sa: عرض أداء FlowField
de_de: FlowField-Leistungsdemo

# Page 1765029509 - Action 3050807915 - Property 1295455071
source: Opens the list of GUID performance test records.
ar_sa: يفتح قائمة سجلات اختبار أداء GUID.
de_de: Öffnet die Liste der GUID-Leistungstest-Datensätze.

# Page 1765029509 - Action 3050807915 - Property 2879900210
source: GUID Performance Test
ar_sa: اختبار أداء GUID
de_de: GUID-Leistungstest

# Page 1765029509 - Action 1664019558 - Property 1295455071
source: Opens the log of truncate operations.
ar_sa: يفتح سجل عمليات truncate.
de_de: Öffnet das Protokoll der Truncate-Vorgänge.

# Page 1765029509 - Action 1664019558 - Property 2879900210
source: Truncate Performance Monitor
ar_sa: مراقب أداء Truncate
de_de: Truncate-Leistungsüberwachung

# Page 1765029509 - Action 3946654702 - Property 2879900210
source: Application
ar_sa: التطبيق
de_de: [NAB: SUGGESTION]Ausgleich [NAB: SUGGESTION]Applikation

# Page 1765029509 - Action 1832424259 - Property 1295455071
source: Demonstrates the posting order optimization in BC 27 for sales documents.
ar_sa: يوضح تحسين ترتيب الترحيل في BC 27 لمستندات المبيعات.
de_de: Demonstriert die Buchungsreihenfolgen-Optimierung in BC 27 für Verkaufsbelege.

# Page 1765029509 - Action 1832424259 - Property 2879900210
source: Posting Order Demo
ar_sa: عرض ترتيب الترحيل
de_de: Buchungsreihenfolge Demo

# Page 1765029509 - Action 2670008000 - Property 1295455071
source: Demonstrates how SQL calls are now visible in the Performance Profiler in BC 27.
ar_sa: يوضح كيف أصبحت استدعاءات SQL مرئية في مصنّف الأداء في BC 27.
de_de: Demonstriert, wie SQL-Aufrufe jetzt im Performance Profiler in BC 27 sichtbar sind.

# Page 1765029509 - Action 2670008000 - Property 2879900210
source: SQL Calls Profiler Demo
ar_sa: عرض مصنّف استدعاءات SQL
de_de: SQL-Aufrufe Profiler Demo

# Page 1765029509 - Action 1941606914 - Property 2879900210
source: Developer
ar_sa: المطور
de_de: [NAB: SUGGESTION]Entwickler

# Page 1765029509 - Action 245311861 - Property 1295455071
source: Demonstrates the Database.LockTimeoutDuration feature introduced in BC 27.
ar_sa: يوضح ميزة Database.LockTimeoutDuration المقدمة في BC 27.
de_de: Demonstriert die in BC 27 eingeführte Database.LockTimeoutDuration-Funktion.

# Page 1765029509 - Action 245311861 - Property 2879900210
source: LockTimeout Demo
ar_sa: عرض LockTimeout
