Repository: duiliotacconi/DT.AL
Catalog: BC27-Performance-Features/Translations/BC27 Performance Features Demo.*.xlf
Languages: ar_sa, de_de

# Page 1765029509 - Action 1832836815 - Property 1295455071
source: Demonstrates the Guid.CreateSequentialGuid() method for improved database performance in BC 27.
ar_sa: يوضح طريقة Guid.CreateSequentialGuid() لتحسين أداء قاعدة البيانات في BC 27.
de_de: Demonstriert die Guid.CreateSequentialGuid()-Methode für verbesserte Datenbankleistung in BC 27.

# Page 1765029509 - Action 1832836815 - Property 2879900210
source: Sequential GUID Demo
ar_sa: عرض GUID التسلسلي
de_de: Sequenzielle GUID Demo

# Page 1765029509 - Action 1981550359 - Property 1295455071
source: Demonstrates the Record.Truncate() method for fast table cleanup in BC 27.
ar_sa: يوضح طريقة Record.Truncate() لتنظيف الجدول بسرعة في BC 27.
de_de: Demonstriert die Record.Truncate()-Methode für schnelle Tabellenbereinigung in BC 27.

# Page 1765029509 - Action 1981550359 - Property 2879900210
source: Rec.Truncate Demo
ar_sa: عرض Rec.Truncate

# Page 1765029509 - Action 2499777063 - Property 2879900210
source: SQL Optimization
ar_sa: تحسين SQL
de_de: SQL-Optimierung

# Page 1765029509 - Action 2982053197 - Property 1295455071
source: Demonstrates FlowField calculation optimizations with SetAutoCalcFields in BC 27.
ar_sa: يوضح تحسينات حساب FlowField مع SetAutoCalcFields في BC 27.
de_de: Demonstriert FlowField-Berechnungsoptimierungen mit SetAutoCalcFields in BC 27.

# Page 1765029509 - Action 2982053197 - Property 2879900210
source: FlowField Optimization Demo
ar_sa: عرض تحسين FlowField
de_de: FlowField-Optimierungsdemo

# Page 1047047942 - Property 2879900210
source: FlowField Performance Demo
ar_sa: عرض أداء FlowField
de_de: FlowField-Leistungsdemo

# Page 1047047942 - Control 4190130733 - Property 1295455071
source: Specifies the unique customer number.
ar_sa: يحدد رقم العميل الفريد.
de_de: Gibt die eindeutige Kundennummer an.

# Page 1047047942 - Control 1524911010 - Property 1295455071
source: Specifies the date of the last sales transaction for this customer (FlowField).
ar_sa: يحدد تاريخ آخر معاملة مبيعات لهذا العميل (FlowField).
de_de: Gibt das Datum der letzten Verkaufstransaktion für diesen Kunden an (FlowField).

# Page 1047047942 - Control 2961552353 - Property 1295455071
source: Specifies the customer name.
ar_sa: يحدد اسم العميل.
de_de: Gibt den Kundennamen an.

# Page 1047047942 - Control 2662608856 - Property 1295455071
source: Specifies the total number of sales entries for this customer (FlowField).
ar_sa: يحدد إجمالي عدد قيود المبيعات لهذا العميل (FlowField).
de_de: Gibt die Gesamtzahl der Verkaufsposten für diesen Kunden an (FlowField).

# Page 1047047942 - Action 2229501958 - Property 1295455071
source: Runs the FlowField optimization demo to show BC 27 SetAutoCalcFields performance improvements.
ar_sa: يشغّل عرض تحسين FlowField لإظهار تحسينات أداء SetAutoCalcFields في BC 27.
de_de: Führt die FlowField-Optimierungsdemo aus, um BC 27 SetAutoCalcFields-Leistungsverbesserungen zu zeigen.

# Page 1047047942 - Action 2229501958 - Property 2879900210
source: Run FlowField Performance Demo
ar_sa: تشغيل عرض أداء FlowField
de_de: FlowField-Leistungsdemo ausführen

# Page 1901643891 - Property 2879900210
source: GUID Performance Test
ar_sa: اختبار أداء GUID
de_de: GUID-Leistungstest

# Page 1901643891 - Control 788537400 - Property 1295455071
source: Specifies the timestamp when the record was created.
ar_sa: يحدد الطابع الزمني عند إنشاء السجل.
de_de: Gibt den Zeitstempel an, wann der Datensatz erstellt wurde.

# Page 1901643891 - Control 3461834954 - Property 1295455071
source: Specifies the description of the test record.
ar_sa: يحدد وصف سجل الاختبار.
de_de: Gibt die Beschreibung des Testdatensatzes an.

# Page 1901643891 - Control 2897660500 - Property 1295455071
source: Specifies the unique record identifier (GUID).
ar_sa: يحدد معرف السجل الفريد (GUID).
de_de: Gibt die eindeutige Datensatzkennung (GUID) an.

# Page 1901643891 - Control 2618029887 - Property 1295455071
source: Specifies the type of GUID generation used (Standard or Sequential).
ar_sa: يحدد نوع إنشاء GUID المستخدم (قياسي أو تسلسلي).
de_de: Gibt den verwendeten GUID-Generierungstyp an (Standard oder Sequenziell).

# Page 1901643891 - Action 1036244905 - Property 1295455071
source: Runs the GUID performance test to compare standard GUIDs vs sequential GUIDs.
ar_sa: يشغّل اختبار أداء GUID لمقارنة معرفات GUID القياسية مقابل التسلسلية.
de_de: Führt den GUID-Leistungstest aus, um Standard-GUIDs mit sequenziellen GUIDs zu vergleichen.

# Page 1901643891 - Action 1036244905 - Property 2879900210
source: Run Performance Test
ar_sa: تشغيل اختبار الأداء
de_de: Leistungstest ausführen

# Page 1401071321 - Property 2879900210
source: Enter Number of Records
ar_sa: إدخال عدد السجلات
de_de: Anzahl der Datensätze eingeben

# Page 1401071321 - NamedType 3914061860
source: Number of records must be greater than 0.
ar_sa: يجب أن يكون عدد السجلات أكبر من 0.
de_de: Anzahl der Datensätze muss größer als 0 sein.

# Page 1401071321 - Control 3123527090 - Property 1968111052
source: The demo will create this many records with standard GUIDs and sequential GUIDs to compare performance.
ar_sa: سينشئ العرض هذا العدد من السجلات بمعرفات GUID قياسية وتسلسلية لمقارنة الأداء.
de_de: Die Demo erstellt so viele Datensätze mit Standard-GUIDs und sequenziellen GUIDs, um die Leistung zu vergleichen.

# Page 1401071321 - Control 3123527090 - Property 2879900210
source: Information
ar_sa: معلومات
de_de: [NAB: SUGGESTION]Informationen

# Page 1401071321 - Control 3567459362 - Property 2879900210
source: Performance Test Parameters
ar_sa: معلمات اختبار الأداء
de_de: Leistungstest-Parameter

# Page 1401071321 - Control 1736541834 - Property 1295455071
source: Enter the number of records to insert for the performance test.
ar_sa: أدخل عدد السجلات المراد إدراجها لاختبار الأداء.
de_de: Geben Sie die Anzahl der Datensätze ein, die für den Leistungstest eingefügt werden sollen.

# Page 1401071321 - Control 1736541834 - Property 2879900210
source: Number of Records
ar_sa: عدد السجلات
de_de: Anzahl der Datensätze

# Page 3160445442 - Property 2879900210
source: Enter Lock Timeout Duration
ar_sa: إدخال مدة مهلة القفل
de_de: Sperrzeitlimit-Dauer eingeben

# Page 3160445442 - NamedType 1908182519
source: Timeout must be greater than 0 seconds.
ar_sa: يجب أن تكون المهلة أكبر من 0 ثانية.
de_de: Zeitlimit muss größer als 0 Sekunden sein.

# Page 3160445442 - Control 3123527090 - Property 1968111052
source: Background holds lock for 15 seconds. Values < 15 will timeout, values > 15 should succeed.
ar_sa: الخلفية تحتفظ بالقفل لمدة 15 ثانية. القيم < 15 ستنتهي المهلة، القيم > 15 يجب أن تنجح.
de_de: Hintergrund hält Sperre für 15 Sekunden. Werte < 15 führen zu Timeout, Werte > 15 sollten erfolgreich sein.

# Page 3160445442 - Control 3123527090 - Property 2879900210
source: Information
ar_sa: معلومات
de_de: [NAB: SUGGESTION]Informationen

# Page 3160445442 - Control 3567459362 - Property 2879900210
source: Lock Timeout Duration
ar_sa: مدة مهلة القفل
de_de: Sperrzeitlimit-Dauer

# Page 3160445442 - Control 766984748 - Property 1295455071
source: Enter the lock timeout duration in seconds.
ar_sa: أدخل مدة مهلة القفل بالثواني.
de_de: Geben Sie die Sperrzeitlimit-Dauer in Sekunden ein.

# Page 3160445442 - Control 766984748 - Property 2879900210
source: Timeout (seconds)
ar_sa: المهلة (بالثواني)
de_de: Zeitlimit (Sekunden)

# Page 955075197 - Property 2879900210
source: Details
ar_sa: التفاصيل
de_de: [NAB: SUGGESTION]Details

# Page 955075197 - Control 2798619357 - Property 1295455071
source: Displays the SQL Server statement captured by the performance profiler
ar_sa: يعرض عبارة SQL Server التي التقطها مصنّف الأداء
de_de: Zeigt die SQL Server-Anweisung an, die vom Leistungsprofiler erfasst wurde

# Page 955075197 - Control 2798619357 - Property 2879900210
source: SQL Statement
ar_sa: عبارة SQL
de_de: SQL-Anweisung

# Page 4048465728 - Property 2879900210
source: Profiling Nodes
ar_sa: عقد التصنيف
de_de: Profilierungsknoten

# Page 4048465728 - Control 971044367 - Property 1295455071
source: Function or method name captured by the profiler
ar_sa: اسم الوظيفة أو الطريقة التي التقطها المصنّف
de_de: Funktions- oder Methodenname, der vom Profiler erfasst wurde

# Page 4048465728 - Control 3286003210 - Property 1295455071
source: Number of times this node was executed
ar_sa: عدد مرات تنفيذ هذه العقدة
de_de: Anzahl der Ausführungen dieses Knotens

# Page 4048465728 - Control 653747200 - Property 1295455071
source: Indicates whether this is a SQL statement
ar_sa: يشير إلى ما إذا كانت هذه عبارة SQL
de_de: Gibt an, ob dies eine SQL-Anweisung ist

# Page 4048465728 - Control 66992343 - Property 1295455071
source: Line number in the source code
ar_sa: رقم السطر في الكود المصدري
de_de: Zeilennummer im Quellcode

# Page 4048465728 - Control 1618236431 - Property 1295455071
source: Unique identifier for the profiling node
ar_sa: معرف فريد لعقدة التصنيف
de_de: Eindeutiger Bezeichner für den Profilierungsknoten

# Page 4048465728 - Control 3711240756 - Property 1295455071
source: ID of AL object
ar_sa: معرف كائن AL
de_de: ID des AL-Objekts

# Page 4048465728 - Control 1418569422 - Property 1295455071
source: Name of AL object
ar_sa: اسم كائن AL
de_de: Name des AL-Objekts

# Page 4048465728 - Control 1085746399 - Property 1295455071
source: Type of AL object
ar_sa: نوع كائن AL
de_de: Typ des AL-Objekts

# Page 948821877 - Property 2879900210
source: Truncate Performance Monitor
ar_sa: مراقب أداء Truncate
de_de: Truncate-Leistungsüberwachung

# Page 948821877 - Control 883711285 - Property 1295455071
source: Specifies the entry number of the log record.
ar_sa: يحدد رقم قيد سجل السجل.
de_de: Gibt die Postennummer des Protokolldatensatzes an.

# Page 948821877 - Control 3127005848 - Property 1295455071
source: Specifies the date and time when the operation was executed.
ar_sa: يحدد التاريخ والوقت عند تنفيذ العملية.
de_de: Gibt Datum und Uhrzeit an, wann der Vorgang ausgeführt wurde.

# Page 948821877 - Control 3156524383 - Property 1295455071
source: Specifies the type of operation (DeleteAll or Truncate).
ar_sa: يحدد نوع العملية (DeleteAll أو Truncate).
de_de: Gibt den Vorgangstyp an (DeleteAll oder Truncate).

# Page 948821877 - Control 2699180384 - Property 1295455071
source: Specifies the number of records affected by the operation.
ar_sa: يحدد عدد السجلات المتأثرة بالعملية.
de_de: Gibt die Anzahl der vom Vorgang betroffenen Datensätze an.

# Page 948821877 - Control 3808951907 - Property 1295455071
source: Specifies the name of the table where the operation was performed.
ar_sa: يحدد اسم الجدول حيث تم تنفيذ العملية.
de_de: Gibt den Namen der Tabelle an, in der der Vorgang ausgeführt wurde.

# Page 948821877 - Control 2708250016 - Property 1295455071
source: Specifies the user who executed the operation.
ar_sa: يحدد المستخدم الذي نفّذ العملية.
de_de: Gibt den Benutzer an, der den Vorgang ausgeführt hat.

# Page 948821877 - Action 3183963928 - Property 1295455071
source: Runs the Truncate demonstration to compare performance between DeleteAll and Truncate methods.
ar_sa: يشغّل عرض Truncate لمقارنة الأداء بين طريقتي DeleteAll وTruncate.
de_de: Führt die Truncate-Demonstration aus, um die Leistung zwischen DeleteAll- und Truncate-Methoden zu vergleichen.

# Page 948821877 - Action 3183963928 - Property 2879900210
source: Run Truncate Demo
ar_sa: تشغيل عرض Truncate
de_de: Truncate-Demo ausführen

# Page 384403156 - Property 2879900210
source: Truncate Performance Test Setup
ar_sa: إعداد اختبار أداء Truncate
de_de: Truncate-Leistungstest-Einrichtung

# Page 384403156 - NamedType 614856224
source: Both Filter From and Filter To must be greater than 0 when filtering is enabled.
ar_sa: يجب أن يكون كلاً من التصفية من والتصفية إلى أكبر من 0 عند تمكين التصفية.
de_de: Sowohl Filter Von als auch Filter Bis müssen größer als 0 sein, wenn die Filterung aktiviert ist.

# Page 384403156 - NamedType 3459022188
source: Filter From must be greater than 0.
ar_sa: يجب أن تكون التصفية من أكبر من 0.
de_de: Filter Von muss größer als 0 sein.

# Page 384403156 - NamedType 3282096652
source: Filter From must be less than or equal to Filter To.
ar_sa: يجب أن تكون التصفية من أقل من أو تساوي التصفية إلى.
de_de: Filter Von muss kleiner oder gleich Filter Bis sein.

# Page 384403156 - NamedType 109647125
source: Filter To cannot exceed the total number of records (%1).
ar_sa: لا يمكن أن تتجاوز التصفية إلى إجمالي عدد السجلات (%1).
de_de: Filter Bis kann die Gesamtzahl der Datensätze (%1) nicht überschreiten.

# Page 384403156 - NamedType 2378980511
source: Filter To must be greater than 0.
ar_sa: يجب أن تكون التصفية إلى أكبر من 0.
de_de: Filter Bis muss größer als 0 sein.

# Page 384403156 - NamedType 3914061860
source: Number of records must be greater than 0.
ar_sa: يجب أن يكون عدد السجلات أكبر من 0.
de_de: Anzahl der Datensätze muss größer als 0 sein.

# Page 384403156 - Control 3123527090 - Property 1968111052
source: Without filtering: compares DeleteAll() vs Truncate() on full table. With filtering: compares DeleteAll() vs Truncate() on filtered records.
ar_sa: بدون تصفية: يقارن DeleteAll() مقابل Truncate() على الجدول بالكامل. مع التصفية: يقارن DeleteAll() مقابل Truncate() على السجلات المصفاة.
de_de: Ohne Filterung: vergleicht DeleteAll() vs. Truncate() auf der gesamten Tabelle. Mit Filterung: vergleicht DeleteAll() vs. Truncate() auf gefilterten Datensätzen.

# Page 384403156 - Control 3123527090 - Property 2879900210
source: Information
ar_sa: معلومات
de_de: [NAB: SUGGESTION]Informationen

# Page 384403156 - Control 3567459362 - Property 2879900210
source: Performance Test Parameters
ar_sa: معلمات اختبار الأداء
de_de: Leistungstest-Parameter

# Page 384403156 - Control 921621410 - Property 1295455071
source: Starting entry number for the filter range. Only used when filtering is enabled.
ar_sa: رقم القيد البادئ لنطاق التصفية. يُستخدم فقط عند تمكين التصفية.
de_de: Startpostennummer für den Filterbereich. Wird nur verwendet, wenn die Filterung aktiviert ist.

# Page 384403156 - Control 921621410 - Property 2879900210
source: Filter From Entry No.
ar_sa: التصفية من رقم القيد
de_de: Filter Von Postennr.

# Page 384403156 - Control 950108477 - Property 1295455071
source: Ending entry number for the filter range. Only used when filtering is enabled.
ar_sa: رقم القيد النهائي لنطاق التصفية. يُستخدم فقط عند تمكين التصفية.
de_de: Endpostennummer für den Filterbereich. Wird nur verwendet, wenn die Filterung aktiviert ist.

# Page 384403156 - Control 950108477 - Property 2879900210
source: Filter To Entry No.
ar_sa: التصفية إلى رقم القيد
de_de: Filter Bis Postennr.

# Page 384403156 - Control 1736541834 - Property 1295455071
source: Enter the number of records to create for the performance test.
ar_sa: أدخل عدد السجلات المراد إنشاؤها لاختبار الأداء.
de_de: Geben Sie die Anzahl der Datensätze ein, die für den Leistungstest erstellt werden sollen.

# Page 384403156 - Control 1736541834 - Property 2879900210
source: Number of Records
ar_sa: عدد السجلات
de_de: Anzahl der Datensätze

# Page 384403156 - Control 1389180058 - Property 1295455071
source: Enable to test both Truncate and DeleteAll with filters to compare performance.
ar_sa: مكّن لاختبار كلاً من Truncate وDeleteAll مع التصفية لمقارنة الأداء.
de_de: Aktivieren, um sowohl Truncate als auch DeleteAll mit Filtern zu testen und die Leistung zu vergleichen.

# Page 384403156 - Control 1389180058 - Property 2879900210
source: Test with Filtering
ar_sa: الاختبار مع التصفية
de_de: Mit Filterung testen

# Enum 198663249 - Property 2879900210
source: Document Type
ar_sa: نوع المستند
de_de: Belegart

# Enum 198663249 - EnumValue 2004364593 - Property 2879900210
source: Credit Memo
ar_sa: إشعار دائن
de_de: Gutschrift

# Enum 198663249 - EnumValue 821689635 - Property 2879900210
source: Invoice
ar_sa: فاتورة
de_de: Rechnung

# Enum 1352703510 - Property 2879900210
source: GUID Record Type
ar_sa: نوع سجل GUID
de_de: GUID-Datensatztyp

# Enum 1352703510 - EnumValue 3103406403 - Property 2879900210
source: Sequential
ar_sa: تسلسلي
de_de: Sequenziell

# Enum 1352703510 - EnumValue 2672704373 - Property 2879900210
source: Standard
ar_sa: قياسي

# Enum 2246001357 - Property 2879900210
source: Operation Type
ar_sa: نوع العملية
de_de: [NAB: SUGGESTION]Vorgangstyp

# Enum 311623126 - Property 2879900210
source: Status
ar_sa: الحالة

# Enum 311623126 - EnumValue 1090351696 - Property 2879900210
source: Active
ar_sa: نشط
de_de: Aktiv

# Enum 311623126 - EnumValue 525852245 - Property 2879900210
source: Inactive
ar_sa: غير نشط
de_de: Inaktiv

# Enum 311623126 - EnumValue 3208180638 - Property 2879900210
source: Processed
ar_sa: معالج
de_de: Verarbeitet

# PermissionSet 1634778039 - Property 2879900210
source: BC27 Performance Features
ar_sa: ميزات أداء BC27
de_de: BC27 Leistungsfunktionen
