Repository: duiliotacconi/DT.AL
Catalog: BC27-Performance-Features/Translations/BC27 Performance Features Demo.*_tradnl.xlf
Languages: es_es_tradnl

# Table 2716516865 - Property 2879900210
source: Customer Demo
es_es_tradnl: Demostración de Cliente

# Table 2716516865 - Field 4190130733 - Property 2879900210
source: Customer No.
es_es_tradnl: [NAB: SUGGESTION]Nº cliente [NAB: SUGGESTION]N.º de cliente [NAB: SUGGESTION]N.º cliente

# Table 2716516865 - Field 1524911010 - Property 2879900210
source: Last Sales Date
es_es_tradnl: Última fecha de venta

# Table 2716516865 - Field 2961552353 - Property 2879900210
source: Name
es_es_tradnl: [NAB: SUGGESTION]Nombre

# Table 2716516865 - Field 2662608856 - Property 2879900210
source: No. of Sales Entries
es_es_tradnl: N.º de movimientos de venta

# Table 1988126737 - Property 2879900210
source: GUID Performance Test Table
es_es_tradnl: Tabla de prueba de rendimiento GUID

# Table 1988126737 - Field 788537400 - Property 2879900210
source: Creation Time
es_es_tradnl: [NAB: SUGGESTION]Tiempo creación

# Table 1988126737 - Field 3461834954 - Property 2879900210
source: Description
es_es_tradnl: [NAB: SUGGESTION]Descripción

# Table 1988126737 - Field 3483320773 - Property 2879900210
source: Performance Notes
es_es_tradnl: Notas de rendimiento

# Table 1988126737 - Field 2897660500 - Property 2879900210
source: Record ID
es_es_tradnl: [NAB: SUGGESTION]Id. de registro [NAB: SUGGESTION]Id. de registro [NAB: SUGGESTION]Id. del registro [NAB: SUGGESTION]Id. del registro [NAB: SUGGESTION]Id. registro

# Table 1988126737 - Field 2618029887 - Property 2879900210
source: Record Type
es_es_tradnl: Tipo de registro

# Table 1268937166 - Field 3461834954 - Property 2879900210
source: Description
es_es_tradnl: [NAB: SUGGESTION]Descripción

# Table 1268937166 - Field 883711285 - Property 2879900210
source: Entry No.
es_es_tradnl: [NAB: SUGGESTION]Nº mov. [NAB: SUGGESTION]N.º mov. [NAB: SUGGESTION]N.º de movimiento

# Table 1268937166 - Field 3320823955 - Property 2879900210
source: Line No.
es_es_tradnl: [NAB: SUGGESTION]Nº línea [NAB: SUGGESTION]N.º línea [NAB: SUGGESTION]N.º de línea

# Table 1268937166 - Field 158172202 - Property 2879900210
source: Line Type
es_es_tradnl: [NAB: SUGGESTION]Tipo línea

# Table 2002860834 - Property 2879900210
source: Profiling Node
es_es_tradnl: Nodo de generación de perfiles

# Table 2002860834 - Field 883711285 - Property 2879900210
source: Entry No.
es_es_tradnl: [NAB: SUGGESTION]Nº mov. [NAB: SUGGESTION]N.º mov. [NAB: SUGGESTION]N.º de movimiento

# Table 2002860834 - Field 971044367 - Property 2879900210
source: Function Name
es_es_tradnl: [NAB: SUGGESTION]Nombre de función

# Table 2002860834 - Field 3286003210 - Property 2879900210
source: Hit Count
es_es_tradnl: [NAB: SUGGESTION]Recuento de resultados

# Table 2002860834 - Field 653747200 - Property 2879900210
source: Is SQL
es_es_tradnl: Es SQL

# Table 2002860834 - Field 66992343 - Property 2879900210
source: Line Number
es_es_tradnl: Número de línea

# Table 2002860834 - Field 1618236431 - Property 2879900210
source: Node ID
es_es_tradnl: [NAB: SUGGESTION]Id. nodo

# Table 2002860834 - Field 3711240756 - Property 2879900210
source: Object ID
es_es_tradnl: [NAB: SUGGESTION]Id. objeto [NAB: SUGGESTION]Id. de objeto [NAB: SUGGESTION]ID objeto

# Table 2002860834 - Field 1418569422 - Property 2879900210
source: Object Name
es_es_tradnl: [NAB: SUGGESTION]Nombre de objeto [NAB: SUGGESTION]Nombre objeto

# Table 2002860834 - Field 1085746399 - Property 2879900210
source: Object Type
es_es_tradnl: [NAB: SUGGESTION]Tipo objeto [NAB: SUGGESTION]Tipo de objeto

# Table 2002860834 - Field 2798619357 - Property 2879900210
source: SQL Statement
es_es_tradnl: Instrucción SQL

# Table 1294644360 - Property 2879900210
source: Sales Entry
es_es_tradnl: Movimiento de venta

# Table 1294644360 - Field 636392376 - Property 2879900210
source: Amount
es_es_tradnl: [NAB: SUGGESTION]Importe

# Table 1294644360 - Field 4190130733 - Property 2879900210
source: Customer No.
es_es_tradnl: [NAB: SUGGESTION]Nº cliente [NAB: SUGGESTION]N.º de cliente [NAB: SUGGESTION]N.º cliente

# Table 1294644360 - Field 2363328873 - Property 2879900210
source: Document Type
es_es_tradnl: [NAB: SUGGESTION]Tipo documento [NAB: SUGGESTION]Tipo de documento

# Table 1294644360 - Field 883711285 - Property 2879900210
source: Entry No.
es_es_tradnl: [NAB: SUGGESTION]Nº mov. [NAB: SUGGESTION]N.º mov. [NAB: SUGGESTION]N.º de movimiento

# Table 1294644360 - Field 3710982960 - Property 2879900210
source: Posting Date
es_es_tradnl: [NAB: SUGGESTION]Fecha registro [NAB: SUGGESTION]Fecha de registro [NAB: SUGGESTION]Fecha reg.

# Table 514555293 - Property 2879900210
source: Truncate Demo Table
es_es_tradnl: Tabla de demostración de Truncate

# Table 514555293 - Field 636392376 - Property 2879900210
source: Amount
es_es_tradnl: [NAB: SUGGESTION]Importe

# Table 514555293 - Field 2500892784 - Property 2879900210
source: Created Date
es_es_tradnl: [NAB: SUGGESTION]Fecha de creación

# Table 514555293 - Field 3461834954 - Property 2879900210
source: Description
es_es_tradnl: [NAB: SUGGESTION]Descripción

# Table 514555293 - Field 883711285 - Property 2879900210
source: Entry No.
es_es_tradnl: [NAB: SUGGESTION]Nº mov. [NAB: SUGGESTION]N.º mov. [NAB: SUGGESTION]N.º de movimiento

# Table 514555293 - Field 984476005 - Property 2879900210
source: Last Modified
es_es_tradnl: [NAB: SUGGESTION]Última modificación

# Table 514555293 - Field 513339096 - Property 2879900210
source: Status
es_es_tradnl: [NAB: SUGGESTION]Estado

# Table 2626921960 - Property 2879900210
source: Truncate Log Table
es_es_tradnl: Tabla de registro de Truncate

# Table 2626921960 - Field 883711285 - Property 2879900210
source: Entry No.
es_es_tradnl: [NAB: SUGGESTION]Nº mov. [NAB: SUGGESTION]N.º mov. [NAB: SUGGESTION]N.º de movimiento

# Table 2626921960 - Field 3127005848 - Property 2879900210
source: Operation DateTime
es_es_tradnl: Fecha/hora de operación

# Table 2626921960 - Field 3156524383 - Property 2879900210
source: Operation Type
es_es_tradnl: Tipo de operación

# Table 2626921960 - Field 2699180384 - Property 2879900210
source: Records Affected
es_es_tradnl: Registros afectados

# Table 2626921960 - Field 3808951907 - Property 2879900210
source: Table Name
es_es_tradnl: [NAB: SUGGESTION]Nombre tabla [NAB: SUGGESTION]Nombre de tabla [NAB: SUGGESTION]Nombre de la tabla

# Table 2626921960 - Field 2708250016 - Property 2879900210
source: User ID
es_es_tradnl: [NAB: SUGGESTION]Id. usuario [NAB: SUGGESTION]Id. de usuario

# Codeunit 2566973998 - NamedType 3924526594
source: %1 profiling nodes extracted and displayed.
es_es_tradnl: %1 nodos de generación de perfiles extraídos y mostrados.

# Codeunit 2334946661 - NamedType 3576202793
source: Do you want to continue?
es_es_tradnl: ¿Desea continuar?

# Codeunit 2334946661 - NamedType 3563305185
source: This demo will:
es_es_tradnl: Esta demostración hará:

# Codeunit 2334946661 - NamedType 1999354891
source: Examples:
es_es_tradnl: Ejemplos:

# Codeunit 2334946661 - NamedType 215669783
source: Failed to start background session.
es_es_tradnl: No se pudo iniciar la sesión en segundo plano.

# Codeunit 2334946661 - NamedType 2184892397
source: Item %1 not found.
es_es_tradnl: Producto %1 no encontrado.

# Codeunit 2334946661 - NamedType 3734205098
source: Lock timeout must be greater than 0 seconds.
es_es_tradnl: El tiempo de espera de bloqueo debe ser mayor que 0 segundos.

# Codeunit 2334946661 - NamedType 1966629216
source: No items found. Please create at least one item to run this demo.
es_es_tradnl: No se encontraron productos. Cree al menos un producto para ejecutar esta demostración.

# Codeunit 2334946661 - NamedType 1904284849
source: Operation succeeded!\\ \\Original timeout duration: %1 seconds\\New timeout duration: %2 seconds\\Elapsed time: %3 seconds
es_es_tradnl: ¡Operación correcta!\\ \\Duración del tiempo de espera original: %1 segundos\\Nueva duración del tiempo de espera: %2 segundos\\Tiempo transcurrido: %3 segundos

# Codeunit 2334946661 - NamedType 3868920883
source: 1. Start a background session that locks an Item record for 15 seconds
es_es_tradnl: 1. Iniciar una sesión en segundo plano que bloquea un registro de Producto durante 15 segundos

# Codeunit 2334946661 - NamedType 4032900822
source: 2. Allow you to set Database.LockTimeoutDuration (BC 27 feature)
es_es_tradnl: 2. Permitirle establecer Database.LockTimeoutDuration (característica de BC 27)

# Codeunit 2334946661 - NamedType 2006519413
source: 3. Try to access the locked record
es_es_tradnl: 3. Intentar acceder al registro bloqueado

# Codeunit 2334946661 - NamedType 1784210992
source: - Timeout > 15 sec → Should succeed (lock released after 15 sec)
es_es_tradnl: - Tiempo de espera > 15 seg → Debería tener éxito (bloqueo liberado después de 15 seg)

# Codeunit 2334946661 - NamedType 2107666801
source: - Timeout < 15 sec → Lock timeout error
es_es_tradnl: - Tiempo de espera < 15 seg → Error de tiempo de espera de bloqueo

# Codeunit 3398506205 - NamedType 3810741809
source: Sales Order posted successfully!
es_es_tradnl: ¡Pedido de venta registrado correctamente!

# Codeunit 3398506205 - Method 2084031962 - NamedType 4172508015
source: Line No.
es_es_tradnl: N.º línea

# Codeunit 3398506205 - Method 2084031962 - NamedType 961827798
source: Type
es_es_tradnl: Tipo

# Codeunit 3398506205 - Method 2084031962 - NamedType 1314000525
source: No.
es_es_tradnl: N.º

# Codeunit 3398506205 - Method 2084031962 - NamedType 1668520216
source: Lines created for %1 %2:
es_es_tradnl: Líneas creadas para %1 %2:

# Codeunit 1800383584 - NamedType 3569966352
source: Description
es_es_tradnl: Descripción

# Codeunit 1800383584 - NamedType 4172508015
source: Line No.
es_es_tradnl: N.º línea

# Codeunit 1800383584 - NamedType 3035987594
source: Line processed %1:
es_es_tradnl: [NAB: REVIEW]

# Codeunit 1800383584 - NamedType 817293845
source: LogMessage is empty but RecordCount = %1
es_es_tradnl: LogMessage está vacío pero RecordCount = %1

# Codeunit 1800383584 - NamedType 461794111
source: No lines were captured in the temp table.
es_es_tradnl: No se capturaron líneas en la tabla temporal.

# Codeunit 1800383584 - NamedType 1979967096
source: Total lines processed: %1\\ \\Legacy Posting Feature: %2\\ \\%3
es_es_tradnl: Total de líneas procesadas: %1\\ \\Característica de registro heredada: %2\\ \\%3

# Codeunit 1800383584 - NamedType 961827798
source: Type
es_es_tradnl: Tipo

# Codeunit 968069251 - NamedType 118881108
source: Performance comparison with FILTERING:\\ \\Total records created: %1\\Filtered records (%2 to %3): %4\\ \\DeleteAll with filter: %5 ms\\Truncate with filter: %6 ms\\ \\Improvement: %7%\\ \\Note: Truncate works with filters and is faster!
es_es_tradnl: Comparación de rendimiento con FILTRADO:\\ \\Registros totales creados: %1\\Registros filtrados (%2 a %3): %4\\ \\DeleteAll con filtro: %5 ms\\Truncate con filtro: %6 ms\\ \\Mejora: %7%\\ \\Nota: ¡Truncate funciona con filtros y es más rápido!

# Codeunit 968069251 - NamedType 2585194780
source: Performance comparison with FILTERING:\\ \\Total records created: %1\\Filtered records (%2 to %3): %4\\ \\DeleteAll with filter: %5 ms\\Truncate with filter: %6 ms\\ \\Performance degradation: %7%\\ \\WARNING: In this case, Truncate with filters is SLOWER than DeleteAll!\\Consider using DeleteAll for filtered deletions when deleting a small subset of records.
es_es_tradnl: Comparación de rendimiento con FILTRADO:\\ \\Registros totales creados: %1\\Registros filtrados (%2 a %3): %4\\ \\DeleteAll con filtro: %5 ms\\Truncate con filtro: %6 ms\\ \\Degradación del rendimiento: %7%\\ \\ADVERTENCIA: ¡En este caso, Truncate con filtros es MÁS LENTO que DeleteAll!\\Considere usar DeleteAll para eliminaciones filtradas al eliminar un subconjunto pequeño de registros.

# Codeunit 968069251 - NamedType 2842742159
source: Performance comparison for %1 records (FULL TABLE):\\ \\DeleteAll: %2 ms\\Truncate: %3 ms\\ \\Note: Truncate is optimized for full table deletion.
es_es_tradnl: Comparación de rendimiento para %1 registros (TABLA COMPLETA):\\ \\DeleteAll: %2 ms\\Truncate: %3 ms\\ \\Nota: Truncate está optimizado para la eliminación de tabla completa.

# Codeunit 968069251 - NamedType 3914061860
source: Number of records must be greater than 0.
es_es_tradnl: El número de registros debe ser mayor que 0.

# Codeunit 968069251 - NamedType 3172945005
source: Testing with %1 records (filtering from %2 to %3)...
es_es_tradnl: Probando con %1 registros (filtrando de %2 a %3)...

# Codeunit 968069251 - NamedType 2406755997
source: Testing with %1 records...
es_es_tradnl: Probando con %1 registros...

# Codeunit 968069251 - NamedType 1165098304
source: Truncate operations completed.\\ \\Truncate is NOT possible when:\\ \\• Table is not a SQL table\\ \\• Table is a system table\\ \\• Used inside try functions\\ \\• Security filters are active\\ \\• There are subscribers to OnBeforeDelete/OnAfterDelete\\ \\• Table has Media fields\\ \\• Too many rows are Marked\\ \\• There are filters on FlowFields\\ \\Always test performance with your specific data patterns.
es_es_tradnl: Operaciones de Truncate completadas.\\ \\Truncate NO es posible cuando:\\ \\• La tabla no es una tabla SQL\\ \\• La tabla es una tabla del sistema\\ \\• Se usa dentro de funciones try\\ \\• Los filtros de seguridad están activos\\ \\• Hay suscriptores a OnBeforeDelete/OnAfterDelete\\ \\• La tabla tiene campos Media\\ \\• Demasiadas filas están marcadas (Marked)\\ \\• Hay filtros en FlowFields\\ \\Siempre pruebe el rendimiento con sus patrones de datos específicos.

# Codeunit 2779520303 - NamedType 3789985513
source: Hooray!\\ \\GUID Comparison (4 consecutive records):\\ \\Standard GUIDs (random order):\\%1\\ \\Sequential GUIDs (ordered):\\%2\\ \\Sequential GUIDs are more performant for database indexing!
es_es_tradnl: ¡Hurra!\\ \\Comparación de GUID (4 registros consecutivos):\\ \\GUID estándar (orden aleatorio):\\%1\\ \\GUID secuenciales (ordenados):\\%2\\ \\¡Los GUID secuenciales son más eficientes para la indexación de bases de datos!

# Codeunit 2779520303 - NamedType 3865284284
source: Performance comparison with %1 records:\\ \\Standard GUID: %2 ms\\Sequential GUID: %3 ms\\ \\Improvement: %4%
es_es_tradnl: Comparación de rendimiento con %1 registros:\\ \\GUID estándar: %2 ms\\GUID secuencial: %3 ms\\ \\Mejora: %4%

# Codeunit 2779520303 - NamedType 3914061860
source: Number of records must be greater than 0.
es_es_tradnl: El número de registros debe ser mayor que 0.

# Codeunit 2779520303 - NamedType 124992251
source: Sequential GUID Record %1
es_es_tradnl: Registro GUID Secuencial %1

# Codeunit 2779520303 - NamedType 1261132669
source: Standard GUID Record %1
es_es_tradnl: Registro GUID Estándar %1

# Codeunit 2779520303 - NamedType 2406755997
source: Testing with %1 records...
es_es_tradnl: Probando con %1 registros...

# Codeunit 3014493327 - NamedType 3720626351
source: Profile download cancelled or failed.
es_es_tradnl: Descarga de perfil cancelada o fallida.

# Codeunit 3014493327 - NamedType 647078506
source: Profile downloaded successfully!\\You can open it in Visual Studio Code with the AL Profiler extension\\to view SQL statements, execution times, and row counts.
es_es_tradnl: ¡Perfil descargado correctamente!\\Puede abrirlo en Visual Studio Code con la extensión AL Profiler\\para ver instrucciones SQL, tiempos de ejecución y recuentos de filas.

# Page 1765029509 - Property 2879900210
source: BC27 Performance Features Demo
es_es_tradnl: Demostración de características de rendimiento de BC27

# Page 1765029509 - NamedType 3569966352
source: This app demonstrates the new performance features introduced in Business Central 27.
es_es_tradnl: Esta aplicación demuestra las nuevas funciones de rendimiento introducidas en Business Central 27.

# Page 1765029509 - NamedType 482611872
source: Optimized FlowField Calculations: Improved performance for FlowField operations
es_es_tradnl: Cálculos FlowField Optimizados: Rendimiento mejorado para operaciones FlowField

# Page 1765029509 - NamedType 3378221178
source: Posting Order: Improved posting sequence for better performance
es_es_tradnl: Orden de Registro: Secuencia de registro mejorada para un mejor rendimiento

# Page 1765029509 - NamedType 881096440
source: LockTimeout: Better handling of database lock timeouts
es_es_tradnl: LockTimeout: Mejor manejo de los tiempos de espera de bloqueo de base de datos

# Page 1765029509 - NamedType 1382634222
source: Guid.CreateSequentialGuid: More performant GUID generation for database keys
es_es_tradnl: Guid.CreateSequentialGuid: Generación de GUID más eficiente para claves de base de datos

# Page 1765029509 - NamedType 226034597
source: SQL Calls in Performance Profiler: View detailed SQL execution information
es_es_tradnl: Llamadas SQL en Perfilador de Rendimiento: Ver información detallada de ejecución SQL

# Page 1765029509 - NamedType 1780485894
source: Rec.Truncate: Faster data cleanup for large tables
es_es_tradnl: Rec.Truncate: Limpieza de datos más rápida para tablas grandes

# Page 1765029509 - NamedType 94419588
source: Welcome to the BC 27 Performance Features Demo!
es_es_tradnl: ¡Bienvenido a la Demo de Funciones de Rendimiento de BC 27!

# Page 1765029509 - Control 3704584207 - Property 2879900210
source: Application Features
es_es_tradnl: Características de aplicación

# Page 1765029509 - Control 1021118283 - Property 2879900210
source: Developer Features
es_es_tradnl: Características de desarrollador

# Page 1765029509 - Control 2445482498 - Property 2879900210
source: BC 27 Performance Features Demonstration
es_es_tradnl: Demostración de características de rendimiento de BC 27

# Page 1765029509 - Control 561197438 - Property 2879900210
source: Server Team Features
es_es_tradnl: Características del equipo de servidor

# Page 1765029509 - Action 3930027771 - Property 2879900210
source: Demo Data Lists
es_es_tradnl: Listas de datos de demostración

# Page 1765029509 - Action 632936411 - Property 1295455071
source: Opens the FlowField performance demonstration page.
es_es_tradnl: Abre la página de demostración de rendimiento de FlowField.

# Page 1765029509 - Action 632936411 - Property 2879900210
source: FlowField Performance Demo
es_es_tradnl: Demostración de rendimiento FlowField

# Page 1765029509 - Action 3050807915 - Property 1295455071
source: Opens the list of GUID performance test records.
es_es_tradnl: Abre la lista de registros de prueba de rendimiento GUID.

# Page 1765029509 - Action 3050807915 - Property 2879900210
source: GUID Performance Test
es_es_tradnl: Prueba de rendimiento GUID

# Page 1765029509 - Action 1664019558 - Property 1295455071
source: Opens the log of truncate operations.
es_es_tradnl: Abre el registro de operaciones de truncado.

# Page 1765029509 - Action 1664019558 - Property 2879900210
source: Truncate Performance Monitor
es_es_tradnl: Monitor de rendimiento de Truncate

# Page 1765029509 - Action 3946654702 - Property 2879900210
source: Application
es_es_tradnl: [NAB: SUGGESTION]Aplicación [NAB: SUGGESTION]Liquidación

# Page 1765029509 - Action 1832424259 - Property 1295455071
source: Demonstrates the posting order optimization in BC 27 for sales documents.
es_es_tradnl: Demuestra la optimización del orden de registro en BC 27 para documentos de venta.

# Page 1765029509 - Action 1832424259 - Property 2879900210
source: Posting Order Demo
es_es_tradnl: Demostración de orden de registro

# Page 1765029509 - Action 2670008000 - Property 1295455071
source: Demonstrates how SQL calls are now visible in the Performance Profiler in BC 27.
es_es_tradnl: Demuestra cómo las llamadas SQL ahora son visibles en el Analizador de rendimiento en BC 27.

# Page 1765029509 - Action 2670008000 - Property 2879900210
source: SQL Calls Profiler Demo
es_es_tradnl: Demostración del generador de perfiles de llamadas SQL

# Page 1765029509 - Action 1941606914 - Property 2879900210
source: Developer
es_es_tradnl: [NAB: SUGGESTION]Desarrollador

# Page 1765029509 - Action 245311861 - Property 1295455071
source: Demonstrates the Database.LockTimeoutDuration feature introduced in BC 27.
es_es_tradnl: Demuestra la función Database.LockTimeoutDuration introducida en BC 27.

# Page 1765029509 - Action 245311861 - Property 2879900210
source: LockTimeout Demo
es_es_tradnl: Demostración de LockTimeout

# Page 1765029509 - Action 1832836815 - Property 1295455071
source: Demonstrates the Guid.CreateSequentialGuid() method for improved database performance in BC 27.
es_es_tradnl: Demuestra el método Guid.CreateSequentialGuid() para mejorar el rendimiento de la base de datos en BC 27.

# Page 1765029509 - Action 1832836815 - Property 2879900210
source: Sequential GUID Demo
es_es_tradnl: Demostración de GUID secuencial

# Page 1765029509 - Action 1981550359 - Property 1295455071
source: Demonstrates the Record.Truncate() method for fast table cleanup in BC 27.
es_es_tradnl: Demuestra el método Record.Truncate() para limpieza rápida de tablas en BC 27.

# Page 1765029509 - Action 1981550359 - Property 2879900210
source: Rec.Truncate Demo
es_es_tradnl: Demostración de Rec.Truncate

# Page 1765029509 - Action 2499777063 - Property 2879900210
source: SQL Optimization
es_es_tradnl: Optimización SQL

# Page 1765029509 - Action 2982053197 - Property 1295455071
source: Demonstrates FlowField calculation optimizations with SetAutoCalcFields in BC 27.
es_es_tradnl: Demuestra las optimizaciones de cálculo de FlowField con SetAutoCalcFields en BC 27.

# Page 1765029509 - Action 2982053197 - Property 2879900210
source: FlowField Optimization Demo
es_es_tradnl: Demostración de optimización de FlowField

# Page 1047047942 - Property 2879900210
source: FlowField Performance Demo
es_es_tradnl: Demostración de rendimiento de FlowField

# Page 1047047942 - Control 4190130733 - Property 1295455071
source: Specifies the unique customer number.
es_es_tradnl: Especifica el número de cliente único.

# Page 1047047942 - Control 1524911010 - Property 1295455071
source: Specifies the date of the last sales transaction for this customer (FlowField).
es_es_tradnl: Especifica la fecha de la última transacción de venta para este cliente (FlowField).

# Page 1047047942 - Control 2961552353 - Property 1295455071
source: Specifies the customer name.
es_es_tradnl: Especifica el nombre del cliente.

# Page 1047047942 - Control 2662608856 - Property 1295455071
source: Specifies the total number of sales entries for this customer (FlowField).
es_es_tradnl: Especifica el número total de movimientos de venta para este cliente (FlowField).

# Page 1047047942 - Action 2229501958 - Property 1295455071
source: Runs the FlowField optimization demo to show BC 27 SetAutoCalcFields performance improvements.
es_es_tradnl: Ejecuta la demostración de optimización de FlowField para mostrar las mejoras de rendimiento de SetAutoCalcFields de BC 27.

# Page 1047047942 - Action 2229501958 - Property 2879900210
source: Run FlowField Performance Demo
es_es_tradnl: Ejecutar demostración de rendimiento FlowField

# Page 1901643891 - Property 2879900210
source: GUID Performance Test
es_es_tradnl: Prueba de rendimiento GUID

# Page 1901643891 - Control 788537400 - Property 1295455071
source: Specifies the timestamp when the record was created.
es_es_tradnl: Especifica la marca de tiempo cuando se creó el registro.

# Page 1901643891 - Control 3461834954 - Property 1295455071
source: Specifies the description of the test record.
es_es_tradnl: Especifica la descripción del registro de prueba.

# Page 1901643891 - Control 2897660500 - Property 1295455071
source: Specifies the unique record identifier (GUID).
es_es_tradnl: Especifica el identificador único del registro (GUID).
